benchmark/results/loadtest.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m01.0s/2m0s

running (0m02.0s), 20/20 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m02.0s/2m0s

running (0m03.0s), 20/20 VUs, 9 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m03.0s/2m0s

running (0m04.0s), 20/20 VUs, 13 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m04.0s/2m0s

running (0m05.0s), 20/20 VUs, 16 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m05.0s/2m0s

running (0m06.0s), 20/20 VUs, 18 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m06.0s/2m0s

running (0m07.0s), 20/20 VUs, 21 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m07.0s/2m0s

running (0m08.0s), 20/20 VUs, 24 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m08.0s/2m0s

running (0m09.0s), 20/20 VUs, 26 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m09.0s/2m0s

running (0m10.0s), 20/20 VUs, 29 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m10.0s/2m0s

running (0m11.0s), 20/20 VUs, 32 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m11.0s/2m0s

running (0m12.0s), 20/20 VUs, 36 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m12.0s/2m0s

running (0m13.0s), 20/20 VUs, 39 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m13.0s/2m0s

running (0m14.0s), 20/20 VUs, 42 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m14.0s/2m0s

running (0m15.0s), 20/20 VUs, 45 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m15.0s/2m0s

running (0m16.0s), 20/20 VUs, 47 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m16.0s/2m0s

running (0m17.0s), 20/20 VUs, 51 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m17.0s/2m0s

running (0m18.0s), 20/20 VUs, 54 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m18.0s/2m0s

running (0m19.0s), 20/20 VUs, 58 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m19.0s/2m0s

running (0m20.0s), 20/20 VUs, 61 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m20.0s/2m0s

running (0m21.0s), 20/20 VUs, 64 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m21.0s/2m0s

running (0m22.0s), 20/20 VUs, 67 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m22.0s/2m0s

running (0m23.0s), 20/20 VUs, 70 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m23.0s/2m0s

running (0m24.0s), 20/20 VUs, 73 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m24.0s/2m0s

running (0m25.0s), 20/20 VUs, 76 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  0m25.0s/2m0s

running (0m26.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m26.0s/2m0s

running (0m27.0s), 20/20 VUs, 82 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m27.0s/2m0s

running (0m28.0s), 20/20 VUs, 85 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  0m28.0s/2m0s

running (0m29.0s), 20/20 VUs, 88 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  0m29.0s/2m0s

running (0m30.0s), 20/20 VUs, 92 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m30.0s/2m0s

running (0m31.0s), 20/20 VUs, 94 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  0m31.0s/2m0s

running (0m32.0s), 20/20 VUs, 98 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m32.0s/2m0s

running (0m33.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m33.0s/2m0s

running (0m34.0s), 20/20 VUs, 103 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  0m34.0s/2m0s

running (0m35.0s), 20/20 VUs, 107 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  0m35.0s/2m0s

running (0m36.0s), 20/20 VUs, 110 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m36.0s/2m0s

running (0m37.0s), 20/20 VUs, 113 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  0m37.0s/2m0s

running (0m38.0s), 20/20 VUs, 116 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m38.0s/2m0s

running (0m39.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m39.0s/2m0s

running (0m40.0s), 20/20 VUs, 124 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m40.0s/2m0s

running (0m41.0s), 20/20 VUs, 127 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  0m41.0s/2m0s

running (0m42.0s), 20/20 VUs, 131 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  0m42.0s/2m0s

running (0m43.0s), 20/20 VUs, 134 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  0m43.0s/2m0s

running (0m44.0s), 20/20 VUs, 137 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m44.0s/2m0s

running (0m45.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m45.0s/2m0s

running (0m46.0s), 20/20 VUs, 144 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  0m46.0s/2m0s

running (0m47.0s), 20/20 VUs, 147 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  0m47.0s/2m0s

running (0m48.0s), 20/20 VUs, 150 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m48.0s/2m0s

running (0m49.0s), 20/20 VUs, 153 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  0m49.0s/2m0s

running (0m50.0s), 20/20 VUs, 156 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m50.0s/2m0s

running (0m51.0s), 20/20 VUs, 159 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m51.0s/2m0s

running (0m52.0s), 20/20 VUs, 162 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  0m52.0s/2m0s

running (0m53.0s), 20/20 VUs, 165 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  0m53.0s/2m0s

running (0m54.0s), 20/20 VUs, 168 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  0m54.0s/2m0s

running (0m55.0s), 20/20 VUs, 171 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  0m55.0s/2m0s

running (0m56.0s), 20/20 VUs, 177 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m56.0s/2m0s

running (0m57.0s), 20/20 VUs, 183 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m57.0s/2m0s

running (0m58.0s), 20/20 VUs, 189 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m58.0s/2m0s

running (0m59.0s), 20/20 VUs, 195 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  0m59.0s/2m0s

running (1m00.0s), 20/20 VUs, 201 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  1m00.0s/2m0s

running (1m01.0s), 20/20 VUs, 207 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  1m01.0s/2m0s

running (1m02.0s), 20/20 VUs, 213 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  1m02.0s/2m0s

running (1m03.0s), 20/20 VUs, 219 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  1m03.0s/2m0s

running (1m04.0s), 20/20 VUs, 225 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  1m04.0s/2m0s

running (1m05.0s), 20/20 VUs, 231 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  1m05.0s/2m0s

running (1m06.0s), 20/20 VUs, 237 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  1m06.0s/2m0s

running (1m07.0s), 20/20 VUs, 243 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  1m07.0s/2m0s

running (1m08.0s), 20/20 VUs, 248 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  1m08.0s/2m0s

running (1m09.0s), 20/20 VUs, 254 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  1m09.0s/2m0s

running (1m10.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  1m10.0s/2m0s

running (1m11.0s), 20/20 VUs, 268 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  1m11.0s/2m0s

running (1m12.0s), 20/20 VUs, 275 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  1m12.0s/2m0s

running (1m13.0s), 20/20 VUs, 282 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  1m13.0s/2m0s

running (1m14.0s), 20/20 VUs, 288 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  1m14.0s/2m0s

running (1m15.0s), 20/20 VUs, 294 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  1m15.0s/2m0s

running (1m16.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  1m16.0s/2m0s

running (1m17.0s), 20/20 VUs, 306 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  1m17.0s/2m0s

running (1m18.0s), 20/20 VUs, 312 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  1m18.0s/2m0s

running (1m19.0s), 20/20 VUs, 318 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  1m19.0s/2m0s

running (1m20.0s), 20/20 VUs, 325 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  1m20.0s/2m0s

running (1m21.0s), 20/20 VUs, 331 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  1m21.0s/2m0s

running (1m22.0s), 20/20 VUs, 338 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  1m22.0s/2m0s

running (1m23.0s), 20/20 VUs, 344 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  1m23.0s/2m0s

running (1m24.0s), 20/20 VUs, 350 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  1m24.0s/2m0s

running (1m25.0s), 20/20 VUs, 357 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  1m25.0s/2m0s

running (1m26.0s), 20/20 VUs, 361 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  1m26.0s/2m0s

running (1m27.0s), 20/20 VUs, 366 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  1m27.0s/2m0s

running (1m28.0s), 20/20 VUs, 373 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  1m28.0s/2m0s

running (1m29.0s), 20/20 VUs, 379 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  1m29.0s/2m0s

running (1m30.0s), 20/20 VUs, 385 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  1m30.0s/2m0s

running (1m31.0s), 20/20 VUs, 392 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  1m31.0s/2m0s

running (1m32.0s), 20/20 VUs, 398 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  1m32.0s/2m0s

running (1m33.0s), 20/20 VUs, 404 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  1m33.0s/2m0s

running (1m34.0s), 20/20 VUs, 410 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  1m34.0s/2m0s

running (1m35.0s), 20/20 VUs, 415 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  1m35.0s/2m0s

running (1m36.0s), 20/20 VUs, 422 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  1m36.0s/2m0s

running (1m37.0s), 20/20 VUs, 428 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  1m37.0s/2m0s

running (1m38.0s), 20/20 VUs, 433 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  1m38.0s/2m0s

running (1m39.0s), 20/20 VUs, 439 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  1m39.0s/2m0s

running (1m40.0s), 20/20 VUs, 446 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  1m40.0s/2m0s

running (1m41.0s), 20/20 VUs, 452 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  1m41.0s/2m0s

running (1m42.0s), 20/20 VUs, 457 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  1m42.0s/2m0s

running (1m43.0s), 20/20 VUs, 463 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  1m43.0s/2m0s

running (1m44.0s), 20/20 VUs, 468 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  1m44.0s/2m0s

running (1m45.0s), 20/20 VUs, 474 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  1m45.0s/2m0s

running (1m46.0s), 20/20 VUs, 480 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  1m46.0s/2m0s

running (1m47.0s), 20/20 VUs, 486 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  1m47.0s/2m0s

running (1m48.0s), 20/20 VUs, 492 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  1m48.0s/2m0s

running (1m49.0s), 20/20 VUs, 498 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  1m49.0s/2m0s

running (1m50.0s), 20/20 VUs, 505 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  1m50.0s/2m0s

running (1m51.0s), 20/20 VUs, 511 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  1m51.0s/2m0s

running (1m52.0s), 20/20 VUs, 518 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  1m52.0s/2m0s

running (1m53.0s), 20/20 VUs, 525 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  1m53.0s/2m0s

running (1m54.0s), 20/20 VUs, 530 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  1m54.0s/2m0s

running (1m55.0s), 20/20 VUs, 537 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  1m55.0s/2m0s

running (1m56.0s), 20/20 VUs, 543 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  1m56.0s/2m0s

running (1m57.0s), 20/20 VUs, 549 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  1m57.0s/2m0s

running (1m58.0s), 20/20 VUs, 556 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  1m58.0s/2m0s

running (1m59.0s), 20/20 VUs, 562 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  1m59.0s/2m0s

running (2m00.0s), 20/20 VUs, 569 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  2m00.0s/2m0s

running (2m01.0s), 14/20 VUs, 575 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  2m0s

running (2m02.0s), 09/20 VUs, 580 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  2m0s

running (2m03.0s), 05/20 VUs, 584 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  2m0s

running (2m04.0s), 02/20 VUs, 587 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  2m0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95) < 4000' p(95)=6.31s

    http_req_failed
    ✓ 'rate < 0.05' rate=0.00%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=3.83s min=317.03ms med=3.52s max=6.84s p(90)=6.2s p(95)=6.31s
      { expected_response:true }...: avg=3.83s min=317.03ms med=3.52s max=6.84s p(90)=6.2s p(95)=6.31s
    http_req_failed................: 0.00%  0 out of 589
    http_reqs......................: 589    4.738363/s

    EXECUTION
    iteration_duration.............: avg=4.14s min=618.21ms med=3.82s max=7.14s p(90)=6.5s p(95)=6.61s
    iterations.....................: 589    4.738363/s
    vus............................: 2      min=2        max=20
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 304 kB 2.4 kB/s
    data_sent......................: 107 kB 860 B/s



running (2m04.3s), 00/20 VUs, 589 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s